W4D5/musicapp/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "andrew.hamacher@gmail.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(email: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "YG-BXDMYegMy7_bz0wKMMA"], ["updated_at", "2019-04-04 19:33:31.909221"], ["id", 2]]
---
  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!