W4D5/musicapp/app/controllers/albums_controller.rb

  def new
    @band = Band.find_by(id: params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)

    if @album.save!
---
INSERT INTO "albums" ("title", "yr", "band_id", "live_album", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "the first"], ["yr", "2019-04-09"], ["band_id", 4], ["live_album", true], ["created_at", "2019-04-04 22:14:09.622421"], ["updated_at", "2019-04-04 22:14:09.622421"]]

  def update
    @album = Album.find_by(id: params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "live_album" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "vvvvvvv"], ["live_album", false], ["updated_at", "2019-04-04 23:43:43.933508"], ["id", 4]]

  def destroy
    @album = Album.find_by(id: params[:id])
    @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 7]]