W4D5/musicapp/app/views/bands/index.html.erb

<ul>
<% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"