W4D5/musicapp/app/views/albums/edit.html.erb

SELECT "bands".* FROM "bands"
---
    <select name="album[band_id]" required>
      <% Band.all.each do |band| %>