W4D5/musicapp/app/views/albums/new.html.erb

    <select name="album[band_id]" required>
      <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"